RIOT-OS/RIOT/cpu/efm32/families/efm32gg11b/include/vendor/efm32gg11b_ebi.h
/* Bit fields for EBI TFTDD */
#define _EBI_TFTDD_RESETVALUE                        0x00000000UL                   /**< Default value for EBI_TFTDD */
#define _EBI_TFTDD_MASK                              0x00FFFFFFUL                   /**< Mask for EBI_TFTDD */
#define _EBI_TFTDD_DATA_SHIFT                        0                              /**< Shift value for EBI_DATA */
#define _EBI_TFTDD_DATA_MASK                         0xFFFFFFUL                     /**< Bit mask for EBI_DATA */
#define _EBI_TFTDD_DATA_DEFAULT                      0x00000000UL                   /**< Mode DEFAULT for EBI_TFTDD */
#define EBI_TFTDD_DATA_DEFAULT                       (_EBI_TFTDD_DATA_DEFAULT << 0) /**< Shifted mode DEFAULT for EBI_TFTDD */

/* Bit fields for EBI TFTALPHA */
#define _EBI_TFTALPHA_RESETVALUE                     0x00000000UL                       /**< Default value for EBI_TFTALPHA */
#define _EBI_TFTALPHA_MASK                           0x000001FFUL                       /**< Mask for EBI_TFTALPHA */
#define _EBI_TFTALPHA_ALPHA_SHIFT                    0                                  /**< Shift value for EBI_ALPHA */
#define _EBI_TFTALPHA_ALPHA_MASK                     0x1FFUL                            /**< Bit mask for EBI_ALPHA */
#define _EBI_TFTALPHA_ALPHA_DEFAULT                  0x00000000UL                       /**< Mode DEFAULT for EBI_TFTALPHA */
#define EBI_TFTALPHA_ALPHA_DEFAULT                   (_EBI_TFTALPHA_ALPHA_DEFAULT << 0) /**< Shifted mode DEFAULT for EBI_TFTALPHA */

/* Bit fields for EBI TFTPIXEL0 */
#define _EBI_TFTPIXEL0_RESETVALUE                    0x00000000UL                       /**< Default value for EBI_TFTPIXEL0 */
#define _EBI_TFTPIXEL0_MASK                          0x00FFFFFFUL                       /**< Mask for EBI_TFTPIXEL0 */
#define _EBI_TFTPIXEL0_DATA_SHIFT                    0                                  /**< Shift value for EBI_DATA */
#define _EBI_TFTPIXEL0_DATA_MASK                     0xFFFFFFUL                         /**< Bit mask for EBI_DATA */
#define _EBI_TFTPIXEL0_DATA_DEFAULT                  0x00000000UL                       /**< Mode DEFAULT for EBI_TFTPIXEL0 */
#define EBI_TFTPIXEL0_DATA_DEFAULT                   (_EBI_TFTPIXEL0_DATA_DEFAULT << 0) /**< Shifted mode DEFAULT for EBI_TFTPIXEL0 */

/* Bit fields for EBI TFTPIXEL1 */
#define _EBI_TFTPIXEL1_RESETVALUE                    0x00000000UL                       /**< Default value for EBI_TFTPIXEL1 */
#define _EBI_TFTPIXEL1_MASK                          0x00FFFFFFUL                       /**< Mask for EBI_TFTPIXEL1 */
#define _EBI_TFTPIXEL1_DATA_SHIFT                    0                                  /**< Shift value for EBI_DATA */
#define _EBI_TFTPIXEL1_DATA_MASK                     0xFFFFFFUL                         /**< Bit mask for EBI_DATA */
#define _EBI_TFTPIXEL1_DATA_DEFAULT                  0x00000000UL                       /**< Mode DEFAULT for EBI_TFTPIXEL1 */
#define EBI_TFTPIXEL1_DATA_DEFAULT                   (_EBI_TFTPIXEL1_DATA_DEFAULT << 0) /**< Shifted mode DEFAULT for EBI_TFTPIXEL1 */

/* Bit fields for EBI TFTPIXEL */
#define _EBI_TFTPIXEL_RESETVALUE                     0x00000000UL                      /**< Default value for EBI_TFTPIXEL */
#define _EBI_TFTPIXEL_MASK                           0x00FFFFFFUL                      /**< Mask for EBI_TFTPIXEL */
#define _EBI_TFTPIXEL_DATA_SHIFT                     0                                 /**< Shift value for EBI_DATA */
#define _EBI_TFTPIXEL_DATA_MASK                      0xFFFFFFUL                        /**< Bit mask for EBI_DATA */
#define _EBI_TFTPIXEL_DATA_DEFAULT                   0x00000000UL                      /**< Mode DEFAULT for EBI_TFTPIXEL */
#define EBI_TFTPIXEL_DATA_DEFAULT                    (_EBI_TFTPIXEL_DATA_DEFAULT << 0) /**< Shifted mode DEFAULT for EBI_TFTPIXEL */

/* Bit fields for EBI TFTMASK */
#define _EBI_TFTMASK_RESETVALUE                      0x00000000UL                        /**< Default value for EBI_TFTMASK */
#define _EBI_TFTMASK_MASK                            0x00FFFFFFUL                        /**< Mask for EBI_TFTMASK */
#define _EBI_TFTMASK_TFTMASK_SHIFT                   0                                   /**< Shift value for EBI_TFTMASK */
#define _EBI_TFTMASK_TFTMASK_MASK                    0xFFFFFFUL                          /**< Bit mask for EBI_TFTMASK */
#define _EBI_TFTMASK_TFTMASK_DEFAULT                 0x00000000UL                        /**< Mode DEFAULT for EBI_TFTMASK */
#define EBI_TFTMASK_TFTMASK_DEFAULT                  (_EBI_TFTMASK_TFTMASK_DEFAULT << 0) /**< Shifted mode DEFAULT for EBI_TFTMASK */

/* Bit fields for EBI IF */
#define _EBI_IF_RESETVALUE                           0x00000000UL                          /**< Default value for EBI_IF */
#define _EBI_IF_MASK                                 0x000003FFUL                          /**< Mask for EBI_IF */
#define EBI_IF_VSYNC                                 (0x1UL << 0)                          /**< Vertical Sync Interrupt Flag */
#define _EBI_IF_VSYNC_SHIFT                          0                                     /**< Shift value for EBI_VSYNC */
#define _EBI_IF_VSYNC_MASK                           0x1UL                                 /**< Bit mask for EBI_VSYNC */
#define _EBI_IF_VSYNC_DEFAULT                        0x00000000UL                          /**< Mode DEFAULT for EBI_IF */
#define EBI_IF_VSYNC_DEFAULT                         (_EBI_IF_VSYNC_DEFAULT << 0)          /**< Shifted mode DEFAULT for EBI_IF */
#define EBI_IF_HSYNC                                 (0x1UL << 1)                          /**< Horizontal Sync Interrupt Flag */
#define _EBI_IF_HSYNC_SHIFT                          1                                     /**< Shift value for EBI_HSYNC */
#define _EBI_IF_HSYNC_MASK                           0x2UL                                 /**< Bit mask for EBI_HSYNC */
#define _EBI_IF_HSYNC_DEFAULT                        0x00000000UL                          /**< Mode DEFAULT for EBI_IF */
#define EBI_IF_HSYNC_DEFAULT                         (_EBI_IF_HSYNC_DEFAULT << 1)          /**< Shifted mode DEFAULT for EBI_IF */
#define EBI_IF_VBPORCH                               (0x1UL << 2)                          /**< Vertical Back Porch Interrupt Flag */
#define _EBI_IF_VBPORCH_SHIFT                        2                                     /**< Shift value for EBI_VBPORCH */
#define _EBI_IF_VBPORCH_MASK                         0x4UL                                 /**< Bit mask for EBI_VBPORCH */
#define _EBI_IF_VBPORCH_DEFAULT                      0x00000000UL                          /**< Mode DEFAULT for EBI_IF */
#define EBI_IF_VBPORCH_DEFAULT                       (_EBI_IF_VBPORCH_DEFAULT << 2)        /**< Shifted mode DEFAULT for EBI_IF */
#define EBI_IF_VFPORCH                               (0x1UL << 3)                          /**< Vertical Front Porch Interrupt Flag */
#define _EBI_IF_VFPORCH_SHIFT                        3                                     /**< Shift value for EBI_VFPORCH */
#define _EBI_IF_VFPORCH_MASK                         0x8UL                                 /**< Bit mask for EBI_VFPORCH */
#define _EBI_IF_VFPORCH_DEFAULT                      0x00000000UL                          /**< Mode DEFAULT for EBI_IF */
#define EBI_IF_VFPORCH_DEFAULT                       (_EBI_IF_VFPORCH_DEFAULT << 3)        /**< Shifted mode DEFAULT for EBI_IF */
#define EBI_IF_DDEMPTY                               (0x1UL << 4)                          /**< Direct Drive Data Empty Interrupt Flag */
#define _EBI_IF_DDEMPTY_SHIFT                        4                                     /**< Shift value for EBI_DDEMPTY */
#define _EBI_IF_DDEMPTY_MASK                         0x10UL                                /**< Bit mask for EBI_DDEMPTY */
#define _EBI_IF_DDEMPTY_DEFAULT                      0x00000000UL                          /**< Mode DEFAULT for EBI_IF */
#define EBI_IF_DDEMPTY_DEFAULT                       (_EBI_IF_DDEMPTY_DEFAULT << 4)        /**< Shifted mode DEFAULT for EBI_IF */
#define EBI_IF_DDJIT                                 (0x1UL << 5)                          /**< Direct Drive Jitter Interrupt Flag */
#define _EBI_IF_DDJIT_SHIFT                          5                                     /**< Shift value for EBI_DDJIT */
#define _EBI_IF_DDJIT_MASK                           0x20UL                                /**< Bit mask for EBI_DDJIT */
#define _EBI_IF_DDJIT_DEFAULT                        0x00000000UL                          /**< Mode DEFAULT for EBI_IF */
#define EBI_IF_DDJIT_DEFAULT                         (_EBI_IF_DDJIT_DEFAULT << 5)          /**< Shifted mode DEFAULT for EBI_IF */
#define EBI_IF_TFTPIXEL0EMPTY                        (0x1UL << 6)                          /**< EBI_TFTPIXEL0 is Empty Interrupt Flag */
#define _EBI_IF_TFTPIXEL0EMPTY_SHIFT                 6                                     /**< Shift value for EBI_TFTPIXEL0EMPTY */
#define _EBI_IF_TFTPIXEL0EMPTY_MASK                  0x40UL                                /**< Bit mask for EBI_TFTPIXEL0EMPTY */
#define _EBI_IF_TFTPIXEL0EMPTY_DEFAULT               0x00000000UL                          /**< Mode DEFAULT for EBI_IF */
#define EBI_IF_TFTPIXEL0EMPTY_DEFAULT                (_EBI_IF_TFTPIXEL0EMPTY_DEFAULT << 6) /**< Shifted mode DEFAULT for EBI_IF */
#define EBI_IF_TFTPIXEL1EMPTY                        (0x1UL << 7)                          /**< EBI_TFTPIXEL1 is Empty Interrupt Flag */
#define _EBI_IF_TFTPIXEL1EMPTY_SHIFT                 7                                     /**< Shift value for EBI_TFTPIXEL1EMPTY */
#define _EBI_IF_TFTPIXEL1EMPTY_MASK                  0x80UL                                /**< Bit mask for EBI_TFTPIXEL1EMPTY */
#define _EBI_IF_TFTPIXEL1EMPTY_DEFAULT               0x00000000UL                          /**< Mode DEFAULT for EBI_IF */
#define EBI_IF_TFTPIXEL1EMPTY_DEFAULT                (_EBI_IF_TFTPIXEL1EMPTY_DEFAULT << 7) /**< Shifted mode DEFAULT for EBI_IF */
#define EBI_IF_TFTPIXELFULL                          (0x1UL << 8)                          /**< EBI_TFTPIXEL is Full Interrupt Flag */
#define _EBI_IF_TFTPIXELFULL_SHIFT                   8                                     /**< Shift value for EBI_TFTPIXELFULL */
#define _EBI_IF_TFTPIXELFULL_MASK                    0x100UL                               /**< Bit mask for EBI_TFTPIXELFULL */
#define _EBI_IF_TFTPIXELFULL_DEFAULT                 0x00000000UL                          /**< Mode DEFAULT for EBI_IF */
#define EBI_IF_TFTPIXELFULL_DEFAULT                  (_EBI_IF_TFTPIXELFULL_DEFAULT << 8)   /**< Shifted mode DEFAULT for EBI_IF */
#define EBI_IF_TFTPIXELOF                            (0x1UL << 9)                          /**< EBI_TFTPIXEL Register Overflow Interrupt Flag */
#define _EBI_IF_TFTPIXELOF_SHIFT                     9                                     /**< Shift value for EBI_TFTPIXELOF */
#define _EBI_IF_TFTPIXELOF_MASK                      0x200UL                               /**< Bit mask for EBI_TFTPIXELOF */
#define _EBI_IF_TFTPIXELOF_DEFAULT                   0x00000000UL                          /**< Mode DEFAULT for EBI_IF */
#define EBI_IF_TFTPIXELOF_DEFAULT                    (_EBI_IF_TFTPIXELOF_DEFAULT << 9)     /**< Shifted mode DEFAULT for EBI_IF */

/* Bit fields for EBI IFS */
#define _EBI_IFS_RESETVALUE                          0x00000000UL                           /**< Default value for EBI_IFS */
#define _EBI_IFS_MASK                                0x000003FFUL                           /**< Mask for EBI_IFS */
#define EBI_IFS_VSYNC                                (0x1UL << 0)                           /**< Vertical Sync Interrupt Flag Set */
#define _EBI_IFS_VSYNC_SHIFT                         0                                      /**< Shift value for EBI_VSYNC */
#define _EBI_IFS_VSYNC_MASK                          0x1UL                                  /**< Bit mask for EBI_VSYNC */
#define _EBI_IFS_VSYNC_DEFAULT                       0x00000000UL                           /**< Mode DEFAULT for EBI_IFS */
#define EBI_IFS_VSYNC_DEFAULT                        (_EBI_IFS_VSYNC_DEFAULT << 0)          /**< Shifted mode DEFAULT for EBI_IFS */
#define EBI_IFS_HSYNC                                (0x1UL << 1)                           /**< Horizontal Sync Interrupt Flag Set */
#define _EBI_IFS_HSYNC_SHIFT                         1                                      /**< Shift value for EBI_HSYNC */
#define _EBI_IFS_HSYNC_MASK                          0x2UL                                  /**< Bit mask for EBI_HSYNC */
#define _EBI_IFS_HSYNC_DEFAULT                       0x00000000UL                           /**< Mode DEFAULT for EBI_IFS */
#define EBI_IFS_HSYNC_DEFAULT                        (_EBI_IFS_HSYNC_DEFAULT << 1)          /**< Shifted mode DEFAULT for EBI_IFS */
#define EBI_IFS_VBPORCH                              (0x1UL << 2)                           /**< Vertical Back Porch Interrupt Flag Set */
#define _EBI_IFS_VBPORCH_SHIFT                       2                                      /**< Shift value for EBI_VBPORCH */
#define _EBI_IFS_VBPORCH_MASK                        0x4UL                                  /**< Bit mask for EBI_VBPORCH */
#define _EBI_IFS_VBPORCH_DEFAULT                     0x00000000UL                           /**< Mode DEFAULT for EBI_IFS */
#define EBI_IFS_VBPORCH_DEFAULT                      (_EBI_IFS_VBPORCH_DEFAULT << 2)        /**< Shifted mode DEFAULT for EBI_IFS */
#define EBI_IFS_VFPORCH                              (0x1UL << 3)                           /**< Vertical Front Porch Interrupt Flag Set */
#define _EBI_IFS_VFPORCH_SHIFT                       3                                      /**< Shift value for EBI_VFPORCH */
#define _EBI_IFS_VFPORCH_MASK                        0x8UL                                  /**< Bit mask for EBI_VFPORCH */
#define _EBI_IFS_VFPORCH_DEFAULT                     0x00000000UL                           /**< Mode DEFAULT for EBI_IFS */
#define EBI_IFS_VFPORCH_DEFAULT                      (_EBI_IFS_VFPORCH_DEFAULT << 3)        /**< Shifted mode DEFAULT for EBI_IFS */
#define EBI_IFS_DDEMPTY                              (0x1UL << 4)                           /**< Direct Drive Data Empty Interrupt Flag Set */
#define _EBI_IFS_DDEMPTY_SHIFT                       4                                      /**< Shift value for EBI_DDEMPTY */
#define _EBI_IFS_DDEMPTY_MASK                        0x10UL                                 /**< Bit mask for EBI_DDEMPTY */
#define _EBI_IFS_DDEMPTY_DEFAULT                     0x00000000UL                           /**< Mode DEFAULT for EBI_IFS */
#define EBI_IFS_DDEMPTY_DEFAULT                      (_EBI_IFS_DDEMPTY_DEFAULT << 4)        /**< Shifted mode DEFAULT for EBI_IFS */
#define EBI_IFS_DDJIT                                (0x1UL << 5)                           /**< Direct Drive Jitter Interrupt Flag Set */
#define _EBI_IFS_DDJIT_SHIFT                         5                                      /**< Shift value for EBI_DDJIT */
#define _EBI_IFS_DDJIT_MASK                          0x20UL                                 /**< Bit mask for EBI_DDJIT */
#define _EBI_IFS_DDJIT_DEFAULT                       0x00000000UL                           /**< Mode DEFAULT for EBI_IFS */
#define EBI_IFS_DDJIT_DEFAULT                        (_EBI_IFS_DDJIT_DEFAULT << 5)          /**< Shifted mode DEFAULT for EBI_IFS */
#define EBI_IFS_TFTPIXEL0EMPTY                       (0x1UL << 6)                           /**< EBI_TFTPIXEL0 Empty Interrupt Flag Set */
#define _EBI_IFS_TFTPIXEL0EMPTY_SHIFT                6                                      /**< Shift value for EBI_TFTPIXEL0EMPTY */
#define _EBI_IFS_TFTPIXEL0EMPTY_MASK                 0x40UL                                 /**< Bit mask for EBI_TFTPIXEL0EMPTY */
#define _EBI_IFS_TFTPIXEL0EMPTY_DEFAULT              0x00000000UL                           /**< Mode DEFAULT for EBI_IFS */
#define EBI_IFS_TFTPIXEL0EMPTY_DEFAULT               (_EBI_IFS_TFTPIXEL0EMPTY_DEFAULT << 6) /**< Shifted mode DEFAULT for EBI_IFS */
#define EBI_IFS_TFTPIXEL1EMPTY                       (0x1UL << 7)                           /**< EBI_TFTPIXEL1 Empty Interrupt Flag Set */
#define _EBI_IFS_TFTPIXEL1EMPTY_SHIFT                7                                      /**< Shift value for EBI_TFTPIXEL1EMPTY */
#define _EBI_IFS_TFTPIXEL1EMPTY_MASK                 0x80UL                                 /**< Bit mask for EBI_TFTPIXEL1EMPTY */
#define _EBI_IFS_TFTPIXEL1EMPTY_DEFAULT              0x00000000UL                           /**< Mode DEFAULT for EBI_IFS */
#define EBI_IFS_TFTPIXEL1EMPTY_DEFAULT               (_EBI_IFS_TFTPIXEL1EMPTY_DEFAULT << 7) /**< Shifted mode DEFAULT for EBI_IFS */
#define EBI_IFS_TFTPIXELFULL                         (0x1UL << 8)                           /**< EBI_TFTPIXEL Full Interrupt Flag Set */
#define _EBI_IFS_TFTPIXELFULL_SHIFT                  8                                      /**< Shift value for EBI_TFTPIXELFULL */
#define _EBI_IFS_TFTPIXELFULL_MASK                   0x100UL                                /**< Bit mask for EBI_TFTPIXELFULL */
#define _EBI_IFS_TFTPIXELFULL_DEFAULT                0x00000000UL                           /**< Mode DEFAULT for EBI_IFS */
#define EBI_IFS_TFTPIXELFULL_DEFAULT                 (_EBI_IFS_TFTPIXELFULL_DEFAULT << 8)   /**< Shifted mode DEFAULT for EBI_IFS */
#define EBI_IFS_TFTPIXELOF                           (0x1UL << 9)                           /**< EBI_TFTPIXEL Overflow Interrupt Flag Set */
#define _EBI_IFS_TFTPIXELOF_SHIFT                    9                                      /**< Shift value for EBI_TFTPIXELOF */
#define _EBI_IFS_TFTPIXELOF_MASK                     0x200UL                                /**< Bit mask for EBI_TFTPIXELOF */
#define _EBI_IFS_TFTPIXELOF_DEFAULT                  0x00000000UL                           /**< Mode DEFAULT for EBI_IFS */
#define EBI_IFS_TFTPIXELOF_DEFAULT                   (_EBI_IFS_TFTPIXELOF_DEFAULT << 9)     /**< Shifted mode DEFAULT for EBI_IFS */

