RIOT-OS/RIOT/cpu/efm32/families/efm32gg11b/include/vendor/efm32gg11b_ebi.h
/* Bit fields for EBI IFC */
#define _EBI_IFC_RESETVALUE                          0x00000000UL                           /**< Default value for EBI_IFC */
#define _EBI_IFC_MASK                                0x000003FFUL                           /**< Mask for EBI_IFC */
#define EBI_IFC_VSYNC                                (0x1UL << 0)                           /**< Vertical Sync Interrupt Flag Clear */
#define _EBI_IFC_VSYNC_SHIFT                         0                                      /**< Shift value for EBI_VSYNC */
#define _EBI_IFC_VSYNC_MASK                          0x1UL                                  /**< Bit mask for EBI_VSYNC */
#define _EBI_IFC_VSYNC_DEFAULT                       0x00000000UL                           /**< Mode DEFAULT for EBI_IFC */
#define EBI_IFC_VSYNC_DEFAULT                        (_EBI_IFC_VSYNC_DEFAULT << 0)          /**< Shifted mode DEFAULT for EBI_IFC */
#define EBI_IFC_HSYNC                                (0x1UL << 1)                           /**< Horizontal Sync Interrupt Flag Clear */
#define _EBI_IFC_HSYNC_SHIFT                         1                                      /**< Shift value for EBI_HSYNC */
#define _EBI_IFC_HSYNC_MASK                          0x2UL                                  /**< Bit mask for EBI_HSYNC */
#define _EBI_IFC_HSYNC_DEFAULT                       0x00000000UL                           /**< Mode DEFAULT for EBI_IFC */
#define EBI_IFC_HSYNC_DEFAULT                        (_EBI_IFC_HSYNC_DEFAULT << 1)          /**< Shifted mode DEFAULT for EBI_IFC */
#define EBI_IFC_VBPORCH                              (0x1UL << 2)                           /**< Vertical Back Porch Interrupt Flag Clear */
#define _EBI_IFC_VBPORCH_SHIFT                       2                                      /**< Shift value for EBI_VBPORCH */
#define _EBI_IFC_VBPORCH_MASK                        0x4UL                                  /**< Bit mask for EBI_VBPORCH */
#define _EBI_IFC_VBPORCH_DEFAULT                     0x00000000UL                           /**< Mode DEFAULT for EBI_IFC */
#define EBI_IFC_VBPORCH_DEFAULT                      (_EBI_IFC_VBPORCH_DEFAULT << 2)        /**< Shifted mode DEFAULT for EBI_IFC */
#define EBI_IFC_VFPORCH                              (0x1UL << 3)                           /**< Vertical Front Porch Interrupt Flag Clear */
#define _EBI_IFC_VFPORCH_SHIFT                       3                                      /**< Shift value for EBI_VFPORCH */
#define _EBI_IFC_VFPORCH_MASK                        0x8UL                                  /**< Bit mask for EBI_VFPORCH */
#define _EBI_IFC_VFPORCH_DEFAULT                     0x00000000UL                           /**< Mode DEFAULT for EBI_IFC */
#define EBI_IFC_VFPORCH_DEFAULT                      (_EBI_IFC_VFPORCH_DEFAULT << 3)        /**< Shifted mode DEFAULT for EBI_IFC */
#define EBI_IFC_DDEMPTY                              (0x1UL << 4)                           /**< Direct Drive Data Empty Interrupt Flag Clear */
#define _EBI_IFC_DDEMPTY_SHIFT                       4                                      /**< Shift value for EBI_DDEMPTY */
#define _EBI_IFC_DDEMPTY_MASK                        0x10UL                                 /**< Bit mask for EBI_DDEMPTY */
#define _EBI_IFC_DDEMPTY_DEFAULT                     0x00000000UL                           /**< Mode DEFAULT for EBI_IFC */
#define EBI_IFC_DDEMPTY_DEFAULT                      (_EBI_IFC_DDEMPTY_DEFAULT << 4)        /**< Shifted mode DEFAULT for EBI_IFC */
#define EBI_IFC_DDJIT                                (0x1UL << 5)                           /**< Direct Drive Jitter Interrupt Flag Clear */
#define _EBI_IFC_DDJIT_SHIFT                         5                                      /**< Shift value for EBI_DDJIT */
#define _EBI_IFC_DDJIT_MASK                          0x20UL                                 /**< Bit mask for EBI_DDJIT */
#define _EBI_IFC_DDJIT_DEFAULT                       0x00000000UL                           /**< Mode DEFAULT for EBI_IFC */
#define EBI_IFC_DDJIT_DEFAULT                        (_EBI_IFC_DDJIT_DEFAULT << 5)          /**< Shifted mode DEFAULT for EBI_IFC */
#define EBI_IFC_TFTPIXEL0EMPTY                       (0x1UL << 6)                           /**< EBI_TFTPIXEL0 Empty Interrupt Flag Clear */
#define _EBI_IFC_TFTPIXEL0EMPTY_SHIFT                6                                      /**< Shift value for EBI_TFTPIXEL0EMPTY */
#define _EBI_IFC_TFTPIXEL0EMPTY_MASK                 0x40UL                                 /**< Bit mask for EBI_TFTPIXEL0EMPTY */
#define _EBI_IFC_TFTPIXEL0EMPTY_DEFAULT              0x00000000UL                           /**< Mode DEFAULT for EBI_IFC */
#define EBI_IFC_TFTPIXEL0EMPTY_DEFAULT               (_EBI_IFC_TFTPIXEL0EMPTY_DEFAULT << 6) /**< Shifted mode DEFAULT for EBI_IFC */
#define EBI_IFC_TFTPIXEL1EMPTY                       (0x1UL << 7)                           /**< EBI_TFTPIXEL1 Empty Interrupt Flag Clear */
#define _EBI_IFC_TFTPIXEL1EMPTY_SHIFT                7                                      /**< Shift value for EBI_TFTPIXEL1EMPTY */
#define _EBI_IFC_TFTPIXEL1EMPTY_MASK                 0x80UL                                 /**< Bit mask for EBI_TFTPIXEL1EMPTY */
#define _EBI_IFC_TFTPIXEL1EMPTY_DEFAULT              0x00000000UL                           /**< Mode DEFAULT for EBI_IFC */
#define EBI_IFC_TFTPIXEL1EMPTY_DEFAULT               (_EBI_IFC_TFTPIXEL1EMPTY_DEFAULT << 7) /**< Shifted mode DEFAULT for EBI_IFC */
#define EBI_IFC_TFTPIXELFULL                         (0x1UL << 8)                           /**< EBI_TFTPIXEL Full Interrupt Flag Clear */
#define _EBI_IFC_TFTPIXELFULL_SHIFT                  8                                      /**< Shift value for EBI_TFTPIXELFULL */
#define _EBI_IFC_TFTPIXELFULL_MASK                   0x100UL                                /**< Bit mask for EBI_TFTPIXELFULL */
#define _EBI_IFC_TFTPIXELFULL_DEFAULT                0x00000000UL                           /**< Mode DEFAULT for EBI_IFC */
#define EBI_IFC_TFTPIXELFULL_DEFAULT                 (_EBI_IFC_TFTPIXELFULL_DEFAULT << 8)   /**< Shifted mode DEFAULT for EBI_IFC */
#define EBI_IFC_TFTPIXELOF                           (0x1UL << 9)                           /**< EBI_TFTPIXEL Overflow Interrupt Flag Clear */
#define _EBI_IFC_TFTPIXELOF_SHIFT                    9                                      /**< Shift value for EBI_TFTPIXELOF */
#define _EBI_IFC_TFTPIXELOF_MASK                     0x200UL                                /**< Bit mask for EBI_TFTPIXELOF */
#define _EBI_IFC_TFTPIXELOF_DEFAULT                  0x00000000UL                           /**< Mode DEFAULT for EBI_IFC */
#define EBI_IFC_TFTPIXELOF_DEFAULT                   (_EBI_IFC_TFTPIXELOF_DEFAULT << 9)     /**< Shifted mode DEFAULT for EBI_IFC */

