RIOT-OS/RIOT/cpu/efm32/families/efm32gg11b/include/vendor/efm32gg11b_ebi.h
/* Bit fields for EBI ROUTELOC1 */
#define _EBI_ROUTELOC1_RESETVALUE                    0x00000000UL                          /**< Default value for EBI_ROUTELOC1 */
#define _EBI_ROUTELOC1_MASK                          0x00070303UL                          /**< Mask for EBI_ROUTELOC1 */
#define _EBI_ROUTELOC1_ADLOC_SHIFT                   0                                     /**< Shift value for EBI_ADLOC */
#define _EBI_ROUTELOC1_ADLOC_MASK                    0x3UL                                 /**< Bit mask for EBI_ADLOC */
#define _EBI_ROUTELOC1_ADLOC_LOC0                    0x00000000UL                          /**< Mode LOC0 for EBI_ROUTELOC1 */
#define _EBI_ROUTELOC1_ADLOC_DEFAULT                 0x00000000UL                          /**< Mode DEFAULT for EBI_ROUTELOC1 */
#define _EBI_ROUTELOC1_ADLOC_LOC1                    0x00000001UL                          /**< Mode LOC1 for EBI_ROUTELOC1 */
#define _EBI_ROUTELOC1_ADLOC_LOC2                    0x00000002UL                          /**< Mode LOC2 for EBI_ROUTELOC1 */
#define EBI_ROUTELOC1_ADLOC_LOC0                     (_EBI_ROUTELOC1_ADLOC_LOC0 << 0)      /**< Shifted mode LOC0 for EBI_ROUTELOC1 */
#define EBI_ROUTELOC1_ADLOC_DEFAULT                  (_EBI_ROUTELOC1_ADLOC_DEFAULT << 0)   /**< Shifted mode DEFAULT for EBI_ROUTELOC1 */
#define EBI_ROUTELOC1_ADLOC_LOC1                     (_EBI_ROUTELOC1_ADLOC_LOC1 << 0)      /**< Shifted mode LOC1 for EBI_ROUTELOC1 */
#define EBI_ROUTELOC1_ADLOC_LOC2                     (_EBI_ROUTELOC1_ADLOC_LOC2 << 0)      /**< Shifted mode LOC2 for EBI_ROUTELOC1 */
#define _EBI_ROUTELOC1_ALOC_SHIFT                    8                                     /**< Shift value for EBI_ALOC */
#define _EBI_ROUTELOC1_ALOC_MASK                     0x300UL                               /**< Bit mask for EBI_ALOC */
#define _EBI_ROUTELOC1_ALOC_LOC0                     0x00000000UL                          /**< Mode LOC0 for EBI_ROUTELOC1 */
#define _EBI_ROUTELOC1_ALOC_DEFAULT                  0x00000000UL                          /**< Mode DEFAULT for EBI_ROUTELOC1 */
#define _EBI_ROUTELOC1_ALOC_LOC1                     0x00000001UL                          /**< Mode LOC1 for EBI_ROUTELOC1 */
#define _EBI_ROUTELOC1_ALOC_LOC2                     0x00000002UL                          /**< Mode LOC2 for EBI_ROUTELOC1 */
#define _EBI_ROUTELOC1_ALOC_LOC3                     0x00000003UL                          /**< Mode LOC3 for EBI_ROUTELOC1 */
#define EBI_ROUTELOC1_ALOC_LOC0                      (_EBI_ROUTELOC1_ALOC_LOC0 << 8)       /**< Shifted mode LOC0 for EBI_ROUTELOC1 */
#define EBI_ROUTELOC1_ALOC_DEFAULT                   (_EBI_ROUTELOC1_ALOC_DEFAULT << 8)    /**< Shifted mode DEFAULT for EBI_ROUTELOC1 */
#define EBI_ROUTELOC1_ALOC_LOC1                      (_EBI_ROUTELOC1_ALOC_LOC1 << 8)       /**< Shifted mode LOC1 for EBI_ROUTELOC1 */
#define EBI_ROUTELOC1_ALOC_LOC2                      (_EBI_ROUTELOC1_ALOC_LOC2 << 8)       /**< Shifted mode LOC2 for EBI_ROUTELOC1 */
#define EBI_ROUTELOC1_ALOC_LOC3                      (_EBI_ROUTELOC1_ALOC_LOC3 << 8)       /**< Shifted mode LOC3 for EBI_ROUTELOC1 */
#define _EBI_ROUTELOC1_RDYLOC_SHIFT                  16                                    /**< Shift value for EBI_RDYLOC */
#define _EBI_ROUTELOC1_RDYLOC_MASK                   0x70000UL                             /**< Bit mask for EBI_RDYLOC */
#define _EBI_ROUTELOC1_RDYLOC_LOC0                   0x00000000UL                          /**< Mode LOC0 for EBI_ROUTELOC1 */
#define _EBI_ROUTELOC1_RDYLOC_DEFAULT                0x00000000UL                          /**< Mode DEFAULT for EBI_ROUTELOC1 */
#define _EBI_ROUTELOC1_RDYLOC_LOC1                   0x00000001UL                          /**< Mode LOC1 for EBI_ROUTELOC1 */
#define _EBI_ROUTELOC1_RDYLOC_LOC2                   0x00000002UL                          /**< Mode LOC2 for EBI_ROUTELOC1 */
#define _EBI_ROUTELOC1_RDYLOC_LOC3                   0x00000003UL                          /**< Mode LOC3 for EBI_ROUTELOC1 */
#define _EBI_ROUTELOC1_RDYLOC_LOC4                   0x00000004UL                          /**< Mode LOC4 for EBI_ROUTELOC1 */
#define _EBI_ROUTELOC1_RDYLOC_LOC5                   0x00000005UL                          /**< Mode LOC5 for EBI_ROUTELOC1 */
#define EBI_ROUTELOC1_RDYLOC_LOC0                    (_EBI_ROUTELOC1_RDYLOC_LOC0 << 16)    /**< Shifted mode LOC0 for EBI_ROUTELOC1 */
#define EBI_ROUTELOC1_RDYLOC_DEFAULT                 (_EBI_ROUTELOC1_RDYLOC_DEFAULT << 16) /**< Shifted mode DEFAULT for EBI_ROUTELOC1 */
#define EBI_ROUTELOC1_RDYLOC_LOC1                    (_EBI_ROUTELOC1_RDYLOC_LOC1 << 16)    /**< Shifted mode LOC1 for EBI_ROUTELOC1 */
#define EBI_ROUTELOC1_RDYLOC_LOC2                    (_EBI_ROUTELOC1_RDYLOC_LOC2 << 16)    /**< Shifted mode LOC2 for EBI_ROUTELOC1 */
#define EBI_ROUTELOC1_RDYLOC_LOC3                    (_EBI_ROUTELOC1_RDYLOC_LOC3 << 16)    /**< Shifted mode LOC3 for EBI_ROUTELOC1 */
#define EBI_ROUTELOC1_RDYLOC_LOC4                    (_EBI_ROUTELOC1_RDYLOC_LOC4 << 16)    /**< Shifted mode LOC4 for EBI_ROUTELOC1 */
#define EBI_ROUTELOC1_RDYLOC_LOC5                    (_EBI_ROUTELOC1_RDYLOC_LOC5 << 16)    /**< Shifted mode LOC5 for EBI_ROUTELOC1 */

/** @} */
/** @} End of group EFM32GG11B_EBI */
/** @} End of group Parts */
#ifdef __cplusplus
}
#endif

